app/controllers/auth_controller.rb

  def login
    user = User.find_by(email: params[:email])

    if user&.authenticate(params[:password])
      token = encode_token({ user_id: user.id })
      check_refresh_token = RefreshToken.find_by_user_id(user.id)
      refresh_token  = check_refresh_token if check_refresh_token.present?
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "ojol_2@jaka.com"], ["LIMIT", 1]]
SELECT "refresh_tokens".* FROM "refresh_tokens" WHERE "refresh_tokens"."user_id" = ? LIMIT ?  [["user_id", 5], ["LIMIT", 1]]