app/controllers/drivers_controller.rb

  def index
    @users = Driver.all
---
SELECT "drivers".* FROM "drivers"

  def create
    @driver = Driver.new(driver_params)

    if @driver.save
---
INSERT INTO "drivers" ("username", "password", "email", "phone", "vehicle_details", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

    def set_driver
      @driver = Driver.find(params[:id])
---
SELECT "drivers".* FROM "drivers" WHERE "drivers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]