app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "password", "email", "phone", "is_active", "created_at", "updated_at", "password_digest", "is_driver") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"